/*
 * @Author: xixi_
 * @Date: 2025-12-06 20:44:24
 * @LastEditors: xixi_
 * @LastEditTime: 2026-02-15 13:34:45
 * @FilePath: /Xncut/XncutCores/XncutWidgets/XncutCardWidget.h
 * Copyright (c) 2020-2026 by xixi_ , All Rights Reserved.
 */

#ifndef XNCUT_CARD_WIDGET_H
#define XNCUT_CARD_WIDGET_H

#include <QWidget>

class QVariantAnimation;
class XncutCardWidget : public QWidget
{
    Q_OBJECT
private:
    /********************************************************************************************************/

    /********************************************************************************************************/

public:
    explicit XncutCardWidget(QString MainText, QString Subtext, QWidget *Parent = NULL);
    ~XncutCardWidget();
    XncutCardWidget(const XncutCardWidget &) = delete;
    XncutCardWidget &operator=(const XncutCardWidget &) = delete;
    /********************************************************************************************************/

    /* 设置显示的图片 */
    void SetImage(const QString &Path);
    /********************************************************************************************************/

    /********************************************************************************************************/

public slots:
    /********************************************************************************************************/

    /********************************************************************************************************/

private:
    /********************************************************************************************************/

    /********************************************************************************************************/

private slots:
    /* 缩放动画值发生改变 */
    void ScaleAnimationValueChanged(const QVariant &Value);
    /********************************************************************************************************/

    /********************************************************************************************************/

protected:
    /* 重载事件 */
    /* 绘制事件 */
    void paintEvent(QPaintEvent *Event) override;
    /********************************************************************************************************/

    /* 鼠标事件 */
    /* 鼠标按下事件 */
    void mousePressEvent(QMouseEvent *Event) override;
    void mouseReleaseEvent(QMouseEvent *Event) override;
    /* void mouseMoveEvent(QMouseEvent *Event) override; */
    /* 进入/离开事件 */
    void enterEvent(QEnterEvent *Event) override;
    void leaveEvent(QEvent *Event) override;
    /********************************************************************************************************/

    /********************************************************************************************************/

signals:
    /* 被点击 */
    void Clicked();
    /********************************************************************************************************/

    /********************************************************************************************************/

private:
    QPixmap M_Pixmap = QPixmap();               /* 图片 */
    QVariantAnimation *M_ScaleAnimation = NULL; /* 缩放动画 */
    double M_ScaleFactor = 1.0;                 /* 缩放因子 */
    QString M_MainText;                         /* 正文 */
    QString M_Subtext;                          /* 副文 */
    /********************************************************************************************************/

    /********************************************************************************************************/
};

#endif // XNCUT_CARD_WIDGET