/*
 * @Author: xixi_
 * @Date: 2025-10-30 23:26:50
 * @LastEditors: xixi_
 * @LastEditTime: 2025-10-30 23:41:07
 * @FilePath: /XncutUI/Test/XncutTitleBar/XncutTitleBarWidget.h
 * Copyright (c) 2020-2025 by xixi_ , All Rights Reserved.
 */

/* 首次想出这个方法的时间2025-07-16 15:47:56 */

#ifndef XNCUT_TITLE_BAR_WIDGET_H
#define XNCUT_TITLE_BAR_WIDGET_H

#include <QWidget>

class QLabel;
class QToolBar;
class XncutTitleBarWidget : public QWidget
{
    Q_OBJECT
private:
    /********************************************************************************************************/

public:
    explicit XncutTitleBarWidget(QWidget *Parent = NULL);
    ~XncutTitleBarWidget();
    /********************************************************************************************************/

    /**
     * @brief 设置LOGO
     * @param LogoImgUrl LOGO的URL
     * @note 你需要知道, LOGO的大小是固定的, 也就意味着设置时会强制缩放到固定大小
     */
    void SetLogoPixmap(QPixmap LogoPixmap);
    /********************************************************************************************************/

    /**
     * @brief 获取工具栏
     * @note 设计这个方法的目的是为了避免一些问题
     **/
    QToolBar *GetToolBar();
    /********************************************************************************************************/

public slots:
    /********************************************************************************************************/

private:
    /********************************************************************************************************/

private slots:
    /********************************************************************************************************/

protected:
    /********************************************************************************************************/

signals:
    /********************************************************************************************************/

private:
    QLabel *M_LogoLabel = NULL;     /* LOGO标签 */
    QToolBar *M_MainToolBar = NULL; /* 工具栏 */
    /********************************************************************************************************/

    /**
     * @note 非常不推荐将三大按钮(i.e., 最小化窗口, 最大化窗口和关闭窗口)写在这里, 这样问题很大
     * @note 还有菜单栏, 之前是这样写的
     * @note 现在是通过GetToolBar方法返回QToolBar指针进行自定义设置无须超频繁修改这里的代码.
     **/
    /********************************************************************************************************/
};

#endif // XNCUT_TITLE_BAR_WIDGET_H
